
## Plan Result

[CI link](https://github.com/malachowski-labs/infrastructure/actions/runs/21111396544)


<pre><code>Plan: 8 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * argocd_application.cluster_config
  * argocd_application.traefik
  * cloudflare_dns_record.this
  * cloudflare_dns_record.wildcard
  * hcloud_load_balancer.this
  * hcloud_load_balancer_target.this
  * helm_release.argocd
  * kubernetes_secret_v1.argocd_repo_access
* Update
  * module.talos.hcloud_server.control_planes[&#34;control-plane-1&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.kubernetes_secret_v1.argo_cluser_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret_v1" "argo_cluser_password" {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argo-initial-admin-secret"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # argocd_application.cluster_config will be created
  + resource "argocd_application" "cluster_config" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = true

      + metadata {
          + generation       = (known after apply)
          + name             = "cluster-config"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
              + server = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "clusters/prod.malachowski.me"
              + repo_url        = "https://github.com/malachowski-labs/manifests"
              + target_revision = "HEAD"

              + directory {
                  + recurse = true
                }
            }

          + sync_policy {
              + sync_options = [
                  + "ServerSideApply=true",
                  + "CreateNamespace=true",
                ]

              + automated {
                  + prune     = true
                  + self_heal = true
                }
            }
        }
    }

  # argocd_application.traefik will be created
  + resource "argocd_application" "traefik" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = true

      + metadata {
          + generation       = (known after apply)
          + name             = "argo-traefik-chart"
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
              + server = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "traefik"
              + repo_url        = "https://github.com/traefik/traefik-helm-chart.git"
              + target_revision = "v38.0.2"

              + helm {
                  + values = <<-EOT
                        logs:
                                    general:
                                      level: INFO
                                    access:
                                      enabled: true
                                  service:
                                    annotations:
                                      load-balancer.hetzner.cloud/location: hel1
                                      load-balancer.hetzner.cloud/name: prod-malachowski-me-lb
                    EOT
                }
            }

          + sync_policy {
              + sync_options = [
                  + "CreateNamespace=true",
                ]

              + automated {
                  + prune     = true
                  + self_heal = true
                }
            }
        }
    }

  # cloudflare_dns_record.this will be created
  + resource "cloudflare_dns_record" "this" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "malachowski.me"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = "aff336ce5012d1e29eb613ba0ec54d9a"
    }

  # cloudflare_dns_record.wildcard will be created
  + resource "cloudflare_dns_record" "wildcard" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "*.malachowski.me"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = "aff336ce5012d1e29eb613ba0ec54d9a"
    }

  # hcloud_load_balancer.this will be created
  + resource "hcloud_load_balancer" "this" {
      + delete_protection  = false
      + id                 = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + labels             = (known after apply)
      + load_balancer_type = "lb11"
      + location           = "hel1"
      + name               = "prod-malachowski-me-lb"
      + network_id         = (known after apply)
      + network_ip         = (known after apply)
      + network_zone       = (known after apply)

      + algorithm (known after apply)

      + target (known after apply)
    }

  # hcloud_load_balancer_target.this will be created
  + resource "hcloud_load_balancer_target" "this" {
      + id               = (known after apply)
      + label_selector   = "role=control-plane"
      + load_balancer_id = (known after apply)
      + type             = "label_selector"
      + use_private_ip   = true
    }

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "7.7.11"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_secret_v1.argocd_repo_access will be created
  + resource "kubernetes_secret_v1" "argocd_repo_access" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "argocd.argoproj.io/secret-type" = "repo-creds"
            }
          + name             = "argo-private-repo-secret"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.talos.hcloud_server.control_planes["control-plane-1"] will be updated in-place
  ~ resource "hcloud_server" "control_planes" {
        id                         = "117738718"
        name                       = "control-plane-1"
        # (20 unchanged attributes hidden)

      - network {
          - alias_ips   = [
              - "10.0.1.100",
            ] -> null
          - ip          = "10.0.1.101" -> null
          - mac_address = "86:00:00:82:6d:43" -> null
          - network_id  = 11848573 -> null
        }
      + network {
          + alias_ips   = []
          + ip          = "10.0.1.101"
          + mac_address = (known after apply)
          + network_id  = 11848573
        }

        # (1 unchanged block hidden)
    }

Plan: 8 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.talos.hcloud_primary_ip.control_plane_ipv4[0],
  on .terraform/modules/talos/network.tf line 63, in resource "hcloud_primary_ip" "control_plane_ipv4":
  63:   datacenter    = data.hcloud_datacenter.this.name

The datacenter attribute is deprecated and will be removed after 1 July 2026.
Please use the location attribute instead. See
https://docs.hetzner.cloud/changelog#2025-12-16-phasing-out-datacenters.

(and one more similar warning elsewhere)
```

</details>



## :warning: Warnings

```hcl
Warning: Argument is deprecated

  with module.talos.hcloud_primary_ip.control_plane_ipv4[0],
  on .terraform/modules/talos/network.tf line 63, in resource "hcloud_primary_ip" "control_plane_ipv4":
  63:   datacenter    = data.hcloud_datacenter.this.name

The datacenter attribute is deprecated and will be removed after 1 July 2026.
Please use the location attribute instead. See
https://docs.hetzner.cloud/changelog#2025-12-16-phasing-out-datacenters.

(and one more similar warning elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"infra-plan","PRNumber":11,"Program":"tfcmt","SHA1":"e739190e84a19cd2b256aa0d4e200dfab505c335","Vars":{},"WorkflowName":"infra-plan"} -->